tutorials/interQHDFoam/2D/uDrop/0.orig/U.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    leftRightWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWalls
    {
        type		zeroGradient;
        vaue		uniform (0 0 0);
        //type            pressureInletOutletVelocity;
        //value           uniform (0 0 0);
    }
    #include	"wedge.include";
}


// ************************************************************************* //
