tutorials/interQHDFoam/2D/uDrop/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftRightWalls
    {
        type            mQhdFlux;
        value           uniform 0;
    }
    bottomWalls
    {
        type            mQhdFlux;
        value           uniform 0;
    }
    topWalls
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }
    #include "wedge.include";
}

// ************************************************************************* //
