tutorials/interQHDFoam/2D/uDrop/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid 0
    volVectorFieldValue U	    (0 0 0)
);

regions
(
    sphereToCell
    {
        centre  (0.0 0.0 5.72e-3);
        radius  0.95e-3;

        fieldValues
        (
            volScalarFieldValue alpha.liquid 1
            volVectorFieldValue U (0 0 -0.55)
        );

    }
);


// ************************************************************************* //
